public/20260224T000001--numerical-integration__math.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-09 Thu 23:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Numerical Integration</title>
<meta name="author" content="Troy Judho Dwijanto" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Numerical Integration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb573ad7">1. Numerical Integration</a>
<ul>
<li><a href="#org58e5f13">1.1. Midpoint Rule</a>
<ul>
<li><a href="#orgc592a8d">1.1.1. Rule</a></li>
</ul>
</li>
<li><a href="#org77a3fe3">1.2. Trapezoidal Rule</a>
<ul>
<li><a href="#org4ba47f6">1.2.1. Rule:</a></li>
</ul>
</li>
<li><a href="#org3df3bda">1.3. Error Theorem</a></li>
<li><a href="#orgc3030fd">1.4. Simpson's Rule</a>
<ul>
<li><a href="#org6938ce9">1.4.1. Rule</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb573ad7" class="outline-2">
<h2 id="orgb573ad7"><span class="section-number-2">1.</span> Numerical Integration</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org58e5f13" class="outline-3">
<h3 id="org58e5f13"><span class="section-number-3">1.1.</span> Midpoint Rule</h3>
<div class="outline-text-3" id="text-1-1">
<p>
\(\text{Width}=\Delta x = \frac{b-a}{n}\)
</p>

<p>
\(\text{Height}=f(xi^*)\)
</p>
</div>
<div id="outline-container-orgc592a8d" class="outline-4">
<h4 id="orgc592a8d"><span class="section-number-4">1.1.1.</span> Rule</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
\[
\int^b_a f(x)dx = \Delta x [f(x_1^*) + f(x_2^*) + ... + f(x_n^*)]
\]
where:
\[
\Delta x = \frac{b-a}{n}
\]
and:
\[
x_i^*=\frac{x_{i-1}+x_i}{2}
\]
#+end
</p>
</div>
</div>
</div>
<div id="outline-container-org77a3fe3" class="outline-3">
<h3 id="org77a3fe3"><span class="section-number-3">1.2.</span> Trapezoidal Rule</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Remember that area of trapezoid is \(A=\frac{1}{2}(b_1+b_2)h\)
</p>

<p>
therefore \(h=\Delta x\) and \(b_1\) and \(b_2\) can be found by plugging x-values into \(f(x)\)
</p>

<p>
So:
</p>

<p>
\[
A \approx \frac{\Delta x}{2}(f(x_0)+f(x_1) + \frac{\Delta x}{2}(f(x_1)+f(x_2)) + \frac{\Delta x}{2}(f(x_2)+f(x_3) ...
\]
</p>
</div>
<div id="outline-container-org4ba47f6" class="outline-4">
<h4 id="org4ba47f6"><span class="section-number-4">1.2.1.</span> Rule:</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
\(\int^b_a f(x)dx \approx \frac{\Delta x}{2}[f(x_0)+2f(x_1)+2f(x_2)+... 2f(x_{n-1})+f(x_n)]\)
where \(\Delta x = \frac{b-a}{n}\)
</p>
</div>
</div>
</div>
<div id="outline-container-org3df3bda" class="outline-3">
<h3 id="org3df3bda"><span class="section-number-3">1.3.</span> Error Theorem</h3>
<div class="outline-text-3" id="text-1-3">
<p>
If we trust the calculation from the calculator, we can compare the results such as:
</p>

<p>
\(|\text{rule result} - \text{calculator value}|\)
</p>

<p>
Whatever provides the least amount of error is the most accurate method for that equation.
</p>

<p>
If we don't have a calculator value, there is a theorem used for <a href="#org77a3fe3">1.2</a>
\(|E_T| \leq \frac{K(b-a)^3}{12n^2}\) 
for <a href="#org58e5f13">Midpoint Rule</a>
\(|E_M| \leq \frac{K(b-a)^3}{24n^2}\)
and for <a href="#orgc3030fd">Simpson's Rule</a>
\(|E_S| \leq \frac{K(b-a)^5}{180n^4}\)
</p>

<p>
\(|f^"(x)| \leq K\) for all \(x\) in \([a,b]\). if \(E_T\) and \(E_M\) are the errors.
</p>

<p>
Aka: K must be the absolute extrema for \(f^"(x)\) between \([a,b]\)
</p>
</div>
</div>
<div id="outline-container-orgc3030fd" class="outline-3">
<h3 id="orgc3030fd"><span class="section-number-3">1.4.</span> Simpson's Rule</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We finna use parabolas.
</p>

<ul class="org-ul">
<li>3 non-colinear points in the xy-plane uniquely determine a parabola</li>
<li>We see the area under the red curve can be approximated by
the area under the green parabola</li>
<li>Every parabola requires 3 points, wherein every 3 points make 
2 intervals. So if \(n\) stands for the number of intervals used.
then \(n\) must be even (otherwise it won't form a parabola).</li>
</ul>
</div>
<div id="outline-container-org6938ce9" class="outline-4">
<h4 id="org6938ce9"><span class="section-number-4">1.4.1.</span> Rule</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
\[
\int^b_a f(x)dx \approx \frac{\Delta x}{3}(f(x_0)+4f(x_1)+2f(x_2)+4f(x_3)+2f(x_4)+...+4f(x_{n-1})+f(x_n))
\]
</p>

<p>
where \(n\) is even and \(\Delta x = \frac{b-a}{n}\)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-02-24 Tue 00:00</p>
<p class="author">Author: Troy Judho Dwijanto</p>
<p class="date">Created: 2026-04-09 Thu 23:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
